
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>七、设计规约 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="styles/website.css">
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="版本历史.html" />
    
    
    <link rel="prev" href="工程结构/服务器.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    一、编程规约
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="编程规约/命名风格.html">
            
                <a href="编程规约/命名风格.html">
            
                    
                    （一）命名风格
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="编程规约/常量定义.html">
            
                <a href="编程规约/常量定义.html">
            
                    
                    （二）常量定义
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="编程规约/代码格式.html">
            
                <a href="编程规约/代码格式.html">
            
                    
                    （三）代码格式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="编程规约/OOP规范.html">
            
                <a href="编程规约/OOP规范.html">
            
                    
                    （四）OOP规范
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="编程规约/集合处理.html">
            
                <a href="编程规约/集合处理.html">
            
                    
                    （五）集合处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="编程规约/并发处理.html">
            
                <a href="编程规约/并发处理.html">
            
                    
                    （六）并发处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="编程规约/控制语句.html">
            
                <a href="编程规约/控制语句.html">
            
                    
                    （七）控制语句
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="编程规约/注释规约.html">
            
                <a href="编程规约/注释规约.html">
            
                    
                    （八）注释规约
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    二、异常日志
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="异常日志/异常处理.html">
            
                <a href="异常日志/异常处理.html">
            
                    
                    （一）异常处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="异常日志/日志规约.html">
            
                <a href="异常日志/日志规约.html">
            
                    
                    （二）日志规范
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="异常日志/其他.html">
            
                <a href="异常日志/其他.html">
            
                    
                    （三）其他
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="单元测试.html">
            
                <a href="单元测试.html">
            
                    
                    三、单元测试
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="安全规约.html">
            
                <a href="安全规约.html">
            
                    
                    四、安全规约
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    五、MySQL数据库
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="MySQL数据库/建表规约.html">
            
                <a href="MySQL数据库/建表规约.html">
            
                    
                    （一）建表规约
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="MySQL数据库/索引规约.html">
            
                <a href="MySQL数据库/索引规约.html">
            
                    
                    （二）索引规约
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.3" data-path="MySQL数据库/SQL语句.html">
            
                <a href="MySQL数据库/SQL语句.html">
            
                    
                    （三）SQL语句
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.4" data-path="MySQL数据库/ORM映射.html">
            
                <a href="MySQL数据库/ORM映射.html">
            
                    
                    （四）ORM映射
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.7" >
            
                <span>
            
                    
                    六、工程结构
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" data-path="工程结构/应用分层.html">
            
                <a href="工程结构/应用分层.html">
            
                    
                    （一）应用分层
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.2" data-path="工程结构/二方库依赖.html">
            
                <a href="工程结构/二方库依赖.html">
            
                    
                    （二）二方库依赖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.3" data-path="工程结构/服务器.html">
            
                <a href="工程结构/服务器.html">
            
                    
                    （三）服务器
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.8" data-path="设计规约.html">
            
                <a href="设计规约.html">
            
                    
                    七、设计规约
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="版本历史.html">
            
                <a href="版本历史.html">
            
                    
                    附1：版本历史 
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="本手册专有名词.html">
            
                <a href="本手册专有名词.html">
            
                    
                    附2：本手册专有名词 
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >七、设计规约</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x4E03;&#x3001;&#x8BBE;&#x8BA1;&#x89C4;&#x7EA6;">&#x4E03;&#x3001;&#x8BBE;&#x8BA1;&#x89C4;&#x7EA6;</h2>
<ol>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;<strong>&#x5B58;&#x50A8;&#x65B9;&#x6848;</strong>&#x548C;<strong>&#x5E95;&#x5C42;&#x6570;&#x636E;&#x7ED3;&#x6784;</strong>&#x7684;&#x8BBE;&#x8BA1;&#x83B7;&#x5F97;&#x8BC4;&#x5BA1;&#x4E00;&#x81F4;&#x901A;&#x8FC7;&#xFF0C;&#x5E76;&#x6C89;&#x6DC0;&#x6210;&#x4E3A;&#x6587;&#x6863;&#x3002;
<br><span style="color:orange">&#x8BF4;&#x660E;</span>:&#x6709;&#x7F3A;&#x9677;&#x7684;&#x5E95;&#x5C42;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x98CE;&#x9669;&#x4E0A;&#x5347;&#xFF0C;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x4E0B;&#x964D;&#xFF0C;&#x91CD;&#x6784;&#x6210;&#x672C;&#x4E5F;&#x4F1A;&#x56E0;&#x5386;&#x53F2;&#x6570; &#x636E;&#x8FC1;&#x79FB;&#x548C;&#x7CFB;&#x7EDF;&#x5E73;&#x6ED1;&#x8FC7;&#x6E21;&#x800C;&#x9661;&#x7136;&#x589E;&#x52A0;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5B58;&#x50A8;&#x65B9;&#x6848;&#x548C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x9700;&#x8981;&#x8BA4;&#x771F;&#x5730;&#x8FDB;&#x884C;&#x8BBE;&#x8BA1;&#x548C;&#x8BC4;&#x5BA1;&#xFF0C; &#x751F;&#x4EA7;&#x73AF;&#x5883;&#x63D0;&#x4EA4;&#x6267;&#x884C;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x8FDB;&#x884C; <code>double check</code>&#x3002; 
<br><span style="color:green">&#x6B63;&#x4F8B;</span>:&#x8BC4;&#x5BA1;&#x5185;&#x5BB9;&#x5305;&#x62EC;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x9009;&#x578B;&#x3001;&#x8868;&#x7ED3;&#x6784;&#x8BBE;&#x8BA1;&#x80FD;&#x5426;&#x6EE1;&#x8DB3;&#x6280;&#x672F;&#x65B9;&#x6848;&#x3001;&#x5B58;&#x53D6;&#x6027;&#x80FD;&#x548C;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x80FD;&#x5426; &#x6EE1;&#x8DB3;&#x4E1A;&#x52A1;&#x53D1;&#x5C55;&#x3001;&#x8868;&#x6216;&#x5B57;&#x6BB5;&#x4E4B;&#x95F4;&#x7684;&#x8FA9;&#x8BC1;&#x5173;&#x7CFB;&#x3001;&#x5B57;&#x6BB5;&#x540D;&#x79F0;&#x3001;&#x5B57;&#x6BB5;&#x7C7B;&#x578B;&#x3001;&#x7D22;&#x5F15;&#x7B49;;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x53D8;&#x66F4;(&#x5982; &#x5728;&#x539F;&#x6709;&#x8868;&#x4E2D;&#x65B0;&#x589E;&#x5B57;&#x6BB5;)&#x4E5F;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x8BC4;&#x5BA1;&#x901A;&#x8FC7;&#x540E;&#x4E0A;&#x7EBF;&#x3002;</li>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x5728;&#x9700;&#x6C42;&#x5206;&#x6790;&#x9636;&#x6BB5;&#xFF0C;&#x5982;&#x679C;&#x4E0E;&#x7CFB;&#x7EDF;&#x4EA4;&#x4E92;&#x7684; <code>User</code> &#x8D85;&#x8FC7;<strong>&#x4E00;&#x7C7B;</strong>&#x5E76;&#x4E14;&#x76F8;&#x5173;&#x7684; <code>User Case</code> &#x8D85;&#x8FC7; <strong>5 &#x4E2A;</strong>&#xFF0C; &#x4F7F;&#x7528;&#x7528;&#x4F8B;&#x56FE;&#x6765;&#x8868;&#x8FBE;&#x66F4;&#x52A0;&#x6E05;&#x6670;&#x7684;&#x7ED3;&#x6784;&#x5316;&#x9700;&#x6C42;&#x3002;</li>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x4E1A;&#x52A1;&#x5BF9;&#x8C61;&#x7684;&#x72B6;&#x6001;&#x8D85;&#x8FC7; <strong>3 &#x4E2A;</strong>&#xFF0C;&#x4F7F;&#x7528;&#x72B6;&#x6001;&#x56FE;&#x6765;&#x8868;&#x8FBE;&#x5E76;&#x4E14;&#x660E;&#x786E;&#x72B6;&#x6001;&#x53D8;&#x5316;&#x7684;&#x5404;&#x4E2A;&#x89E6;&#x53D1; &#x6761;&#x4EF6;&#x3002;
<br><span style="color:orange">&#x8BF4;&#x660E;</span>:&#x72B6;&#x6001;&#x56FE;&#x7684;&#x6838;&#x5FC3;&#x662F;&#x5BF9;&#x8C61;&#x72B6;&#x6001;&#xFF0C;&#x9996;&#x5148;&#x660E;&#x786E;&#x5BF9;&#x8C61;&#x6709;&#x591A;&#x5C11;&#x79CD;&#x72B6;&#x6001;&#xFF0C;&#x7136;&#x540E;&#x660E;&#x786E;&#x4E24;&#x4E24;&#x72B6;&#x6001;&#x4E4B;&#x95F4;&#x662F;&#x5426;&#x5B58; &#x5728;&#x76F4;&#x63A5;&#x8F6C;&#x6362;&#x5173;&#x7CFB;&#xFF0C;&#x518D;&#x660E;&#x786E;&#x89E6;&#x53D1;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x7684;&#x6761;&#x4EF6;&#x662F;&#x4EC0;&#x4E48;&#x3002; <br><span style="color:green">&#x6B63;&#x4F8B;</span>:&#x6DD8;&#x5B9D;&#x8BA2;&#x5355;&#x72B6;&#x6001;&#x6709;&#x5DF2;&#x4E0B;&#x5355;&#x3001;&#x5F85;&#x4ED8;&#x6B3E;&#x3001;&#x5DF2;&#x4ED8;&#x6B3E;&#x3001;&#x5F85;&#x53D1;&#x8D27;&#x3001;&#x5DF2;&#x53D1;&#x8D27;&#x3001;&#x5DF2;&#x6536;&#x8D27;&#x7B49;&#x3002;&#x6BD4;&#x5982;&#x5DF2;&#x4E0B;&#x5355;&#x4E0E; &#x5DF2;&#x6536;&#x8D27;&#x8FD9;&#x4E24;&#x79CD;&#x72B6;&#x6001;&#x4E4B;&#x95F4;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x6709;&#x76F4;&#x63A5;&#x8F6C;&#x6362;&#x5173;&#x7CFB;&#x7684;&#x3002;</li>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x4E2D;&#x67D0;&#x4E2A;&#x529F;&#x80FD;&#x7684;&#x8C03;&#x7528;&#x94FE;&#x8DEF;&#x4E0A;&#x7684;&#x6D89;&#x53CA;&#x5BF9;&#x8C61;&#x8D85;&#x8FC7; <strong>3 &#x4E2A;</strong>&#xFF0C;&#x4F7F;&#x7528;&#x65F6;&#x5E8F;&#x56FE;&#x6765;&#x8868;&#x8FBE;&#x5E76;&#x4E14;&#x660E;&#x786E; &#x5404;&#x8C03;&#x7528;&#x73AF;&#x8282;&#x7684;&#x8F93;&#x5165;&#x4E0E;&#x8F93;&#x51FA;&#x3002;
<br><span style="color:orange">&#x8BF4;&#x660E;</span>:&#x65F6;&#x5E8F;&#x56FE;&#x53CD;&#x6620;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x5BF9;&#x8C61;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x4E0E;&#x534F;&#x4F5C;&#x5173;&#x7CFB;&#xFF0C;&#x6E05;&#x6670;&#x7ACB;&#x4F53;&#x5730;&#x53CD;&#x6620;&#x7CFB;&#x7EDF;&#x7684;&#x8C03;&#x7528;&#x7EB5;&#x6DF1;&#x94FE;&#x8DEF;&#x3002;</li>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x4E2D;&#x6A21;&#x578B;&#x7C7B;&#x8D85;&#x8FC7; <strong>5 &#x4E2A;</strong>&#xFF0C;&#x5E76;&#x4E14;&#x5B58;&#x5728;&#x590D;&#x6742;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x4F7F;&#x7528;&#x7C7B;&#x56FE;&#x6765;&#x8868;&#x8FBE;&#x5E76;&#x4E14;&#x660E;&#x786E;&#x7C7B; &#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;
<br><span style="color:orange">&#x8BF4;&#x660E;</span>:&#x7C7B;&#x56FE;&#x50CF;&#x5EFA;&#x7B51;&#x9886;&#x57DF;&#x7684;&#x65BD;&#x5DE5;&#x56FE;&#xFF0C;&#x5982;&#x679C;&#x642D;&#x5E73;&#x623F;&#xFF0C;&#x53EF;&#x80FD;&#x4E0D;&#x9700;&#x8981;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x5EFA;&#x9020;&#x8682;&#x8681; Z &#x7A7A;&#x95F4;&#x5927;&#x697C;&#xFF0C;&#x80AF; &#x5B9A;&#x9700;&#x8981;&#x8BE6;&#x7EC6;&#x7684;&#x65BD;&#x5DE5;&#x56FE;&#x3002;</li>
<li>&#x3010;&#x5F3A;&#x5236;&#x3011;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x4E2D;&#x8D85;&#x8FC7; <strong>2 &#x4E2A;</strong>&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x534F;&#x4F5C;&#x5173;&#x7CFB;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x8868;&#x793A;&#x590D;&#x6742;&#x7684;&#x5904;&#x7406;&#x6D41;&#x7A0B;&#xFF0C;&#x4F7F;&#x7528;&#x6D3B;&#x52A8;&#x56FE;&#x6765;&#x8868;&#x793A;&#x3002;
<br><span style="color:orange">&#x8BF4;&#x660E;</span>:&#x6D3B;&#x52A8;&#x56FE;&#x662F;&#x6D41;&#x7A0B;&#x56FE;&#x7684;&#x6269;&#x5C55;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x80FD;&#x591F;&#x4F53;&#x73B0;&#x534F;&#x4F5C;&#x5173;&#x7CFB;&#x7684;&#x5BF9;&#x8C61;&#x6CF3;&#x9053;&#xFF0C;&#x652F;&#x6301;&#x8868;&#x793A;&#x5E76;&#x53D1;&#x7B49;&#x3002;</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x9700;&#x6C42;&#x5206;&#x6790;&#x4E0E;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x5728;&#x8003;&#x8651;&#x4E3B;&#x5E72;&#x529F;&#x80FD;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x5145;&#x5206;&#x8BC4;&#x4F30;&#x5F02;&#x5E38;&#x6D41;&#x7A0B;&#x4E0E;&#x4E1A;&#x52A1;&#x8FB9;&#x754C;&#x3002;
<br><span style="color:red">&#x53CD;&#x4F8B;</span>:&#x7528;&#x6237;&#x5728;&#x6DD8;&#x5B9D;&#x4ED8;&#x6B3E;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x94F6;&#x884C;&#x6263;&#x6B3E;&#x6210;&#x529F;&#xFF0C;&#x53D1;&#x9001;&#x7ED9;&#x7528;&#x6237;&#x6263;&#x6B3E;&#x6210;&#x529F;&#x77ED;&#x4FE1;&#xFF0C;&#x4F46;&#x662F;&#x652F;&#x4ED8;&#x5B9D;&#x5165;&#x6B3E;&#x65F6; &#x7531;&#x4E8E;&#x65AD;&#x7F51;&#x6F14;&#x7EC3;&#x4EA7;&#x751F;&#x5F02;&#x5E38;&#xFF0C;&#x6DD8;&#x5B9D;&#x8BA2;&#x5355;&#x9875;&#x9762;&#x4F9D;&#x7136;&#x663E;&#x793A;&#x672A;&#x4ED8;&#x6B3E;&#xFF0C;&#x5BFC;&#x81F4;&#x7528;&#x6237;&#x6295;&#x8BC9;&#x3002;</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x7C7B;&#x5728;&#x8BBE;&#x8BA1;&#x4E0E;&#x5B9E;&#x73B0;&#x65F6;&#x8981;&#x7B26;&#x5408;&#x5355;&#x4E00;&#x539F;&#x5219;&#x3002;
<br><span style="color:orange">&#x8BF4;&#x660E;</span>:&#x5355;&#x4E00;&#x539F;&#x5219;&#x6700;&#x6613;&#x7406;&#x89E3;&#x5374;&#x662F;&#x6700;&#x96BE;&#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x6761;&#x89C4;&#x5219;&#xFF0C;&#x968F;&#x7740;&#x7CFB;&#x7EDF;&#x6F14;&#x8FDB;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x5FD8;&#x8BB0;&#x4E86;&#x7C7B;&#x8BBE;&#x8BA1; &#x7684;&#x521D;&#x8877;&#x3002;</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x8C28;&#x614E;&#x4F7F;&#x7528;&#x7EE7;&#x627F;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#xFF0C;&#x4F18;&#x5148;&#x4F7F;&#x7528;&#x805A;&#x5408;/&#x7EC4;&#x5408;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;&#x3002;
<br><span style="color:orange">&#x8BF4;&#x660E;</span>:&#x4E0D;&#x5F97;&#x5DF2;&#x4F7F;&#x7528;&#x7EE7;&#x627F;&#x7684;&#x8BDD;&#xFF0C;&#x5FC5;&#x987B;&#x7B26;&#x5408;&#x91CC;&#x6C0F;&#x4EE3;&#x6362;&#x539F;&#x5219;&#xFF0C;&#x6B64;&#x539F;&#x5219;&#x8BF4;&#x7236;&#x7C7B;&#x80FD;&#x591F;&#x51FA;&#x73B0;&#x7684;&#x5730;&#x65B9;&#x5B50;&#x7C7B;&#x4E00;&#x5B9A;&#x80FD;&#x591F;&#x51FA;&#x73B0;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x201C;&#x628A;&#x94B1;&#x4EA4;&#x51FA;&#x6765;&#x201D;&#xFF0C;&#x94B1;&#x7684;&#x5B50;&#x7C7B;&#x7F8E;&#x5143;&#x3001;&#x6B27;&#x5143;&#x3001;&#x4EBA;&#x6C11;&#x5E01;&#x7B49;&#x90FD;&#x53EF;&#x4EE5;&#x51FA;&#x73B0;&#x3002;</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x65F6;&#xFF0C;&#x6839;&#x636E;&#x4F9D;&#x8D56;&#x5012;&#x7F6E;&#x539F;&#x5219;&#xFF0C;&#x5C3D;&#x91CF;&#x4F9D;&#x8D56;&#x62BD;&#x8C61;&#x7C7B;&#x4E0E;&#x63A5;&#x53E3;&#xFF0C;&#x6709;&#x5229;&#x4E8E;&#x6269;&#x5C55;&#x4E0E;&#x7EF4;&#x62A4;&#x3002;
<br><span style="color:orange">&#x8BF4;&#x660E;</span>:&#x4F4E;&#x5C42;&#x6B21;&#x6A21;&#x5757;&#x4F9D;&#x8D56;&#x4E8E;&#x9AD8;&#x5C42;&#x6B21;&#x6A21;&#x5757;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x65B9;&#x4FBF;&#x7CFB;&#x7EDF;&#x95F4;&#x7684;&#x89E3;&#x8026;&#x3002;</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x65F6;&#xFF0C;&#x6CE8;&#x610F;&#x5BF9;&#x6269;&#x5C55;&#x5F00;&#x653E;&#xFF0C;&#x5BF9;&#x4FEE;&#x6539;&#x95ED;&#x5408;&#x3002;
<br><span style="color:orange">&#x8BF4;&#x660E;</span>:&#x6781;&#x7AEF;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4EA4;&#x4ED8;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x662F;&#x4E0D;&#x53EF;&#x4FEE;&#x6539;&#x7684;&#xFF0C;&#x540C;&#x4E00;&#x4E1A;&#x52A1;&#x57DF;&#x5185;&#x7684;&#x9700;&#x6C42;&#x53D8;&#x5316;&#xFF0C;&#x901A;&#x8FC7;&#x6A21;&#x5757;&#x6216;&#x7C7B;&#x7684; &#x6269;&#x5C55;&#x6765;&#x5B9E;&#x73B0;&#x3002;</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x9636;&#x6BB5;&#xFF0C;&#x5171;&#x6027;&#x4E1A;&#x52A1;&#x6216;&#x516C;&#x5171;&#x884C;&#x4E3A;&#x62BD;&#x53D6;&#x51FA;&#x6765;&#x516C;&#x5171;&#x6A21;&#x5757;&#x3001;&#x516C;&#x5171;&#x914D;&#x7F6E;&#x3001;&#x516C;&#x5171;&#x7C7B;&#x3001;&#x516C;&#x5171;&#x65B9; &#x6CD5;&#x7B49;&#xFF0C;&#x907F;&#x514D;&#x51FA;&#x73B0;&#x91CD;&#x590D;&#x4EE3;&#x7801;&#x6216;&#x91CD;&#x590D;&#x914D;&#x7F6E;&#x7684;&#x60C5;&#x51B5;&#x3002;
<br><span style="color:orange">&#x8BF4;&#x660E;</span>:&#x968F;&#x7740;&#x4EE3;&#x7801;&#x7684;&#x91CD;&#x590D;&#x6B21;&#x6570;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#xFF0C;&#x7EF4;&#x62A4;&#x6210;&#x672C;&#x6307;&#x6570;&#x7EA7;&#x4E0A;&#x5347;&#x3002;</li>
<li>&#x3010;&#x63A8;&#x8350;&#x3011;&#x907F;&#x514D;&#x5982;&#x4E0B;&#x8BEF;&#x89E3;:<br><span style="color:red"><code>&#x654F;&#x6377;&#x5F00;&#x53D1; = &#x8BB2;&#x6545;&#x4E8B; + &#x7F16;&#x7801; + &#x53D1;&#x5E03;</code></span>&#x3002;
<br><span style="color:orange">&#x8BF4;&#x660E;</span>:&#x654F;&#x6377;&#x5F00;&#x53D1;&#x662F;&#x5FEB;&#x901F;&#x4EA4;&#x4ED8;&#x8FED;&#x4EE3;&#x53EF;&#x7528;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x7701;&#x7565;&#x591A;&#x4F59;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;&#xFF0C;&#x6452;&#x5F03;&#x4F20;&#x7EDF;&#x7684;&#x5BA1;&#x6279;&#x6D41;&#x7A0B;&#xFF0C;&#x4F46; &#x6838;&#x5FC3;&#x5173;&#x952E;&#x70B9;&#x4E0A;&#x7684;&#x5FC5;&#x8981;&#x8BBE;&#x8BA1;&#x548C;&#x6587;&#x6863;&#x6C89;&#x6DC0;&#x662F;&#x9700;&#x8981;&#x7684;&#x3002;
<br><span style="color:red">&#x53CD;&#x4F8B;</span>:&#x67D0;&#x56E2;&#x961F;&#x4E3A;&#x4E86;&#x4E1A;&#x52A1;&#x5FEB;&#x901F;&#x53D1;&#x5C55;&#xFF0C;&#x654F;&#x6377;&#x6210;&#x4E86;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x50AC;&#x8FDB;&#x5EA6;&#x7684;&#x501F;&#x53E3;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E2D;&#x5747;&#x662F;&#x52C9;&#x5F3A;&#x80FD;&#x8FD0;&#x884C;&#x4F46;&#x50CF;&#x9762;&#x6761;&#x4E00;&#x6837;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x548C;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x6781;&#x5DEE;&#xFF0C;&#x4E00;&#x5E74;&#x4E4B;&#x540E;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x8FDB;&#x884C;&#x5927;&#x89C4;&#x6A21;&#x91CD;&#x6784;&#xFF0C;&#x5F97;&#x4E0D;&#x507F;&#x5931;&#x3002;</li>
<li>&#x3010;&#x53C2;&#x8003;&#x3011;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x660E;&#x786E;&#x9700;&#x6C42;&#x3001;&#x7406;&#x987A;&#x903B;&#x8F91;&#x3001;&#x540E;&#x671F;&#x7EF4;&#x62A4;&#xFF0C;&#x6B21;&#x8981;&#x76EE;&#x7684;&#x7528;&#x4E8E;&#x6307;&#x5BFC;&#x7F16;&#x7801;&#x3002;
<br><span style="color:orange">&#x8BF4;&#x660E;</span>:&#x907F;&#x514D;&#x4E3A;&#x4E86;&#x8BBE;&#x8BA1;&#x800C;&#x8BBE;&#x8BA1;&#xFF0C;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x6587;&#x6863;&#x6709;&#x52A9;&#x4E8E;&#x540E;&#x671F;&#x7684;&#x7CFB;&#x7EDF;&#x7EF4;&#x62A4;&#xFF0C;&#x6240;&#x4EE5;&#x8BBE;&#x8BA1;&#x7ED3;&#x679C;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5206;
&#x7C7B;&#x5F52;&#x6863;&#x4FDD;&#x5B58;&#x3002;</li>
<li>&#x3010;&#x53C2;&#x8003;&#x3011;&#x8BBE;&#x8BA1;&#x7684;&#x672C;&#x8D28;&#x5C31;&#x662F;&#x8BC6;&#x522B;&#x548C;&#x8868;&#x8FBE;&#x7CFB;&#x7EDF;&#x96BE;&#x70B9;&#xFF0C;&#x627E;&#x5230;&#x7CFB;&#x7EDF;&#x7684;&#x53D8;&#x5316;&#x70B9;&#xFF0C;&#x5E76;&#x9694;&#x79BB;&#x53D8;&#x5316;&#x70B9;&#x3002;
<br><span style="color:orange">&#x8BF4;&#x660E;</span>:&#x4E16;&#x95F4;&#x4F17;&#x591A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x76EE;&#x7684;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x5373;&#x9694;&#x79BB;&#x7CFB;&#x7EDF;&#x53D8;&#x5316;&#x70B9;&#x3002;</li>
<li>&#x3010;&#x53C2;&#x8003;&#x3011;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x76EE;&#x7684;:<ul>
<li>&#x786E;&#x5B9A;&#x7CFB;&#x7EDF;&#x8FB9;&#x754C;&#x3002;&#x786E;&#x5B9A;&#x7CFB;&#x7EDF;&#x5728;&#x6280;&#x672F;&#x5C42;&#x9762;&#x4E0A;&#x7684;&#x505A;&#x4E0E;&#x4E0D;&#x505A;&#x3002;</li>
<li>&#x786E;&#x5B9A;&#x7CFB;&#x7EDF;&#x5185;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x786E;&#x5B9A;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x53CA;&#x6A21;&#x5757;&#x7684;&#x5B8F;&#x89C2;&#x8F93;&#x5165;&#x4E0E;&#x8F93;&#x51FA;&#x3002;</li>
<li>&#x786E;&#x5B9A;&#x6307;&#x5BFC;&#x540E;&#x7EED;&#x8BBE;&#x8BA1;&#x4E0E;&#x6F14;&#x5316;&#x7684;&#x539F;&#x5219;&#x3002;&#x4F7F;&#x540E;&#x7EED;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#x6216;&#x6A21;&#x5757;&#x8BBE;&#x8BA1;&#x5728;&#x89C4;&#x5B9A;&#x7684;&#x6846;&#x67B6;&#x5185;&#x7EE7;&#x7EED;&#x6F14;&#x5316;&#x3002; </li>
<li>&#x786E;&#x5B9A;&#x975E;&#x529F;&#x80FD;&#x6027;&#x9700;&#x6C42;&#x3002;&#x975E;&#x529F;&#x80FD;&#x6027;&#x9700;&#x6C42;&#x662F;&#x6307;&#x5B89;&#x5168;&#x6027;&#x3001;&#x53EF;&#x7528;&#x6027;&#x3001;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x7B49;&#x3002;</li>
</ul>
</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="工程结构/服务器.html" class="navigation navigation-prev " aria-label="Previous page: （三）服务器">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="版本历史.html" class="navigation navigation-next " aria-label="Next page: 附1：版本历史 ">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"七、设计规约","level":"1.8","depth":1,"next":{"title":"附1：版本历史 ","level":"1.9","depth":1,"path":"版本历史.md","ref":"版本历史.md","articles":[]},"previous":{"title":"（三）服务器","level":"1.7.3","depth":2,"path":"工程结构/服务器.md","ref":"工程结构/服务器.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["book-summary-scroll-position-saver","github","prism","-sharing","-highlight"],"pluginsConfig":{"github":{"url":"https://github.com/alibaba/p3c"},"book-summary-scroll-position-saver":{},"prism":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css"}},"file":{"path":"设计规约.md","mtime":"2019-04-24T09:09:41.715Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-04-24T09:19:44.766Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-book-summary-scroll-position-saver/book-summary-scroll-position-saver.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

